CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RTEPIN_Basic
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RTEPIN_Basic(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t OLED_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB20 (pin 99)  */
    GPIO_PinInit(RTEPIN_BASIC_OLED_RST_GPIO, RTEPIN_BASIC_OLED_RST_PIN, &OLED_RST_config);

    gpio_pin_config_t OLED_D_C_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB21 (pin 100)  */
    GPIO_PinInit(RTEPIN_BASIC_OLED_D_C_GPIO, RTEPIN_BASIC_OLED_D_C_PIN, &OLED_D_C_config);

    gpio_pin_config_t OLED_SCK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB22 (pin 101)  */
    GPIO_PinInit(RTEPIN_BASIC_OLED_SCK_GPIO, RTEPIN_BASIC_OLED_SCK_PIN, &OLED_SCK_config);

    gpio_pin_config_t OLED_SOT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB23 (pin 102)  */
    GPIO_PinInit(RTEPIN_BASIC_OLED_SOT_GPIO, RTEPIN_BASIC_OLED_SOT_PIN, &OLED_SOT_config);

    /* PORTA0 (pin 50) is configured as JTAG_TCLK */
    PORT_SetPinMux(RTEPIN_BASIC_SWO_CLK_PORT, RTEPIN_BASIC_SWO_CLK_PIN, kPORT_MuxAlt7);

    /* PORTA11 (pin 63) is configured as PTA11 */
    PORT_SetPinMux(RTEPIN_BASIC_SWITCH_1_PORT, RTEPIN_BASIC_SWITCH_1_PIN, kPORT_MuxAsGpio);

    /* PORTA13 (pin 65) is configured as PTA13 */
    PORT_SetPinMux(RTEPIN_BASIC_SWITCH_2_PORT, RTEPIN_BASIC_SWITCH_2_PIN, kPORT_MuxAsGpio);

    /* PORTA15 (pin 67) is configured as PTA15 */
    PORT_SetPinMux(RTEPIN_BASIC_SWITCH_3_PORT, RTEPIN_BASIC_SWITCH_3_PIN, kPORT_MuxAsGpio);

    /* PORTA18 (pin 72) is configured as EXTAL0 */
    PORT_SetPinMux(PORTA, 18U, kPORT_PinDisabledOrAnalog);

    /* PORTA3 (pin 53) is configured as JTAG_TMS */
    PORT_SetPinMux(RTEPIN_BASIC_SWO_DIO_PORT, RTEPIN_BASIC_SWO_DIO_PIN, kPORT_MuxAlt7);

    /* PORTA5 (pin 55) is configured as JTAG_TRST_b */
    PORT_SetPinMux(RTEPIN_BASIC_RST_PORT, RTEPIN_BASIC_RST_PIN, kPORT_MuxAlt7);

    /* PORTA7 (pin 59) is configured as ADC0_SE10 */
    PORT_SetPinMux(PORTA, 7U, kPORT_PinDisabledOrAnalog);

    /* PORTA8 (pin 60) is configured as ADC0_SE11 */
    PORT_SetPinMux(PORTA, 8U, kPORT_PinDisabledOrAnalog);

    /* PORTA9 (pin 61) is configured as PTA9 */
    PORT_SetPinMux(RTEPIN_BASIC_SWITCH_0_PORT, RTEPIN_BASIC_SWITCH_0_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 81) is configured as FTM1_QD_PHA */
    PORT_SetPinMux(RTEPIN_BASIC_ENCO_LA_PORT, RTEPIN_BASIC_ENCO_LA_PIN, kPORT_MuxAlt6);

    /* PORTB1 (pin 82) is configured as FTM1_QD_PHB */
    PORT_SetPinMux(RTEPIN_BASIC_ENCO_LB_PORT, RTEPIN_BASIC_ENCO_LB_PIN, kPORT_MuxAlt6);

    /* PORTB18 (pin 97) is configured as FTM2_QD_PHA */
    PORT_SetPinMux(RTEPIN_BASIC_ENCO_RA_PORT, RTEPIN_BASIC_ENCO_RA_PIN, kPORT_MuxAlt6);

    /* PORTB19 (pin 98) is configured as FTM2_QD_PHB */
    PORT_SetPinMux(RTEPIN_BASIC_ENCO_RB_PORT, RTEPIN_BASIC_ENCO_RB_PIN, kPORT_MuxAlt6);

    /* PORTB20 (pin 99) is configured as PTB20 */
    PORT_SetPinMux(RTEPIN_BASIC_OLED_RST_PORT, RTEPIN_BASIC_OLED_RST_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[20] = ((PORTB->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB21 (pin 100) is configured as PTB21 */
    PORT_SetPinMux(RTEPIN_BASIC_OLED_D_C_PORT, RTEPIN_BASIC_OLED_D_C_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[21] = ((PORTB->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB22 (pin 101) is configured as PTB22 */
    PORT_SetPinMux(RTEPIN_BASIC_OLED_SCK_PORT, RTEPIN_BASIC_OLED_SCK_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[22] = ((PORTB->PCR[22] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB23 (pin 102) is configured as PTB23 */
    PORT_SetPinMux(RTEPIN_BASIC_OLED_SOT_PORT, RTEPIN_BASIC_OLED_SOT_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[23] = ((PORTB->PCR[23] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTC1 (pin 104) is configured as FTM0_CH0 */
    PORT_SetPinMux(RTEPIN_BASIC_MOTOR_RA_PORT, RTEPIN_BASIC_MOTOR_RA_PIN, kPORT_MuxAlt4);

    /* PORTC10 (pin 115) is configured as PTC10 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_2_PORT, RTEPIN_BASIC_CAM_D_2_PIN, kPORT_MuxAsGpio);

