CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.c
    /* PORTC11 (pin 116) is configured as PTC11 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_3_PORT, RTEPIN_BASIC_CAM_D_3_PIN, kPORT_MuxAsGpio);

    /* PORTC12 (pin 117) is configured as PTC12 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_4_PORT, RTEPIN_BASIC_CAM_D_4_PIN, kPORT_MuxAsGpio);

    /* PORTC13 (pin 118) is configured as PTC13 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_5_PORT, RTEPIN_BASIC_CAM_D_5_PIN, kPORT_MuxAsGpio);

    /* PORTC14 (pin 119) is configured as PTC14 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_6_PORT, RTEPIN_BASIC_CAM_D_6_PIN, kPORT_MuxAsGpio);

    /* PORTC15 (pin 120) is configured as PTC15 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_7_PORT, RTEPIN_BASIC_CAM_D_7_PIN, kPORT_MuxAsGpio);

    /* PORTC16 (pin 123) is configured as UART3_RX */
    PORT_SetPinMux(PORTC, 16U, kPORT_MuxAlt3);

    /* PORTC17 (pin 124) is configured as UART3_TX */
    PORT_SetPinMux(PORTC, 17U, kPORT_MuxAlt3);

    /* PORTC18 (pin 125) is configured as PTC18 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_PCLK_PORT, RTEPIN_BASIC_CAM_PCLK_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 105) is configured as FTM0_CH1 */
    PORT_SetPinMux(RTEPIN_BASIC_MOTOR_RB_PORT, RTEPIN_BASIC_MOTOR_RB_PIN, kPORT_MuxAlt4);

    /* PORTC3 (pin 106) is configured as FTM0_CH2 */
    PORT_SetPinMux(RTEPIN_BASIC_MOTOR_LA_PORT, RTEPIN_BASIC_MOTOR_LA_PIN, kPORT_MuxAlt4);

    /* PORTC4 (pin 109) is configured as FTM0_CH3 */
    PORT_SetPinMux(RTEPIN_BASIC_MOTOR_LB_PORT, RTEPIN_BASIC_MOTOR_LB_PIN, kPORT_MuxAlt4);

    /* PORTC6 (pin 111) is configured as PTC6 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_VSNC_PORT, RTEPIN_BASIC_CAM_VSNC_PIN, kPORT_MuxAsGpio);

    /* PORTC8 (pin 113) is configured as PTC8 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_0_PORT, RTEPIN_BASIC_CAM_D_0_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 114) is configured as PTC9 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_1_PORT, RTEPIN_BASIC_CAM_D_1_PIN, kPORT_MuxAsGpio);

    /* PORTD8 (pin 137) is configured as I2C0_SCL */
    PORT_SetPinMux(RTEPIN_BASIC_IMU_SCL_PORT, RTEPIN_BASIC_IMU_SCL_PIN, kPORT_MuxAlt2);

    PORTD->PCR[8] = ((PORTD->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTD9 (pin 138) is configured as I2C0_SDA */
    PORT_SetPinMux(RTEPIN_BASIC_IMU_SDA_PORT, RTEPIN_BASIC_IMU_SDA_PIN, kPORT_MuxAlt2);

    PORTD->PCR[9] = ((PORTD->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTE0 (pin 1) is configured as SDHC0_D1 */
    PORT_SetPinMux(RTEPIN_BASIC_SD_D_1_PORT, RTEPIN_BASIC_SD_D_1_PIN, kPORT_MuxAlt4);

    /* PORTE1 (pin 2) is configured as SDHC0_D0 */
    PORT_SetPinMux(RTEPIN_BASIC_SD_D_0_PORT, RTEPIN_BASIC_SD_D_0_PIN, kPORT_MuxAlt4);

    /* PORTE10 (pin 13) is configured as PTE10 */
    PORT_SetPinMux(RTEPIN_BASIC_BUTTON_OK_PORT, RTEPIN_BASIC_BUTTON_OK_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[10] = ((PORTE->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTE11 (pin 14) is configured as PTE11 */
    PORT_SetPinMux(RTEPIN_BASIC_BUTTON_DN_PORT, RTEPIN_BASIC_BUTTON_DN_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[11] = ((PORTE->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTE12 (pin 15) is configured as FTM3_CH7 */
    PORT_SetPinMux(RTEPIN_BASIC_SERVO_0_PORT, RTEPIN_BASIC_SERVO_0_PIN, kPORT_MuxAlt6);

    /* PORTE2 (pin 3) is configured as SDHC0_DCLK */
    PORT_SetPinMux(RTEPIN_BASIC_SD_CLK_PORT, RTEPIN_BASIC_SD_CLK_PIN, kPORT_MuxAlt4);

    /* PORTE24 (pin 45) is configured as ADC0_SE17 */
    PORT_SetPinMux(PORTE, 24U, kPORT_PinDisabledOrAnalog);

    /* PORTE25 (pin 46) is configured as ADC0_SE18 */
    PORT_SetPinMux(PORTE, 25U, kPORT_PinDisabledOrAnalog);

    /* PORTE3 (pin 4) is configured as SDHC0_CMD */
    PORT_SetPinMux(RTEPIN_BASIC_SD_CMD_PORT, RTEPIN_BASIC_SD_CMD_PIN, kPORT_MuxAlt4);

    /* PORTE4 (pin 7) is configured as PTE4 */
    PORT_SetPinMux(RTEPIN_BASIC_SD_D_3_PORT, RTEPIN_BASIC_SD_D_3_PIN, kPORT_MuxAsGpio);

    /* PORTE5 (pin 8) is configured as PTE5 */
    PORT_SetPinMux(RTEPIN_BASIC_SD_D_2_PORT, RTEPIN_BASIC_SD_D_2_PIN, kPORT_MuxAsGpio);

    /* PORTE6 (pin 9) is configured as PTE6 */
    PORT_SetPinMux(PORTE, 6U, kPORT_MuxAsGpio);

    /* PORTE7 (pin 10) is configured as PTE7 */
    PORT_SetPinMux(RTEPIN_BASIC_BUTTON_UP_PORT, RTEPIN_BASIC_BUTTON_UP_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[7] = ((PORTE->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTE8 (pin 11) is configured as PTE8 */
    PORT_SetPinMux(RTEPIN_BASIC_BUTTON_LF_PORT, RTEPIN_BASIC_BUTTON_LF_PIN, kPORT_MuxAsGpio);

